In [1]:
import pandas as pd
import seaborn as sn
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("dataset_titanic.csv",sep = ";")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,343,No,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
1,76,No,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
2,641,No,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
3,568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
4,672,No,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,10,Yes,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
887,61,No,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C
888,535,No,3,"Cacic, Miss. Marija",female,30.0,0,0,315084,8.6625,NaN,S
889,102,No,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
890,428,Yes,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.0,0,0,250655,26.0000,NaN,S

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df["Age"].fillna(df["Age"].mean(),inplace = True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,343,No,2,"Collander, Mr. Erik Gustaf",male,28.000000,0,0,248740,13.0000,NaN,S
1,76,No,3,"Moen, Mr. Sigurd Hansen",male,25.000000,0,0,348123,7.6500,F G73,S
2,641,No,3,"Jensen, Mr. Hans Peder",male,20.000000,0,0,350050,7.8542,NaN,S
3,568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.000000,0,4,349909,21.0750,NaN,S
4,672,No,1,"Davidson, Mr. Thornton",male,31.000000,1,0,F.C. 12750,52.0000,B71,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,10,Yes,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C
887,61,No,3,"Sirayanian, Mr. Orsen",male,22.000000,0,0,2669,7.2292,NaN,C
888,535,No,3,"Cacic, Miss. Marija",female,30.000000,0,0,315084,8.6625,NaN,S
889,102,No,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,29.699118,0,0,349215,7.8958,NaN,S
890,428,Yes,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.000000,0,0,250655,26.0000,NaN,S

In [5]:
df.drop('Cabin',inplace = True,axis = 1)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [7]:


Title_Dictionary = {

                    "Capt":       "Officer",

                    "Col":        "Officer",

                    "Major":      "Officer",

                    "Dr":         "Officer",

                    "Rev":        "Officer",

                    "Jonkheer":   "Royalty",

                    "Don":        "Royalty",

                    "Sir" :       "Royalty",

                    "Lady" :      "Royalty",

                    "the Countess" : "Royalty",
    
                    "Dona":       "Royalty",

                    "Mme":        "Miss",

                    "Mlle":       "Miss",

                    "Miss" :      "Miss",

                    "Ms":         "Mrs",

                    "Mr" :        "Mrs",

                    "Mrs" :       "Mrs",

                    "Master" :    "Master"}

In [8]:
q = []

for i in df["Name"]:
    title = i.split(".")[0].split(",")[1]
    q.append(title)
        
df["Status"] = q

In [9]:
df.drop("Name",axis=1,inplace = True)
df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Status
0,343,No,2,male,28.000000,0,0,248740,13.0000,S,Mr
1,76,No,3,male,25.000000,0,0,348123,7.6500,S,Mr
2,641,No,3,male,20.000000,0,0,350050,7.8542,S,Mr
3,568,No,3,female,29.000000,0,4,349909,21.0750,S,Mrs
4,672,No,1,male,31.000000,1,0,F.C. 12750,52.0000,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...
886,10,Yes,2,female,14.000000,1,0,237736,30.0708,C,Mrs
887,61,No,3,male,22.000000,0,0,2669,7.2292,C,Mr
888,535,No,3,female,30.000000,0,0,315084,8.6625,S,Miss
889,102,No,3,male,29.699118,0,0,349215,7.8958,S,Mr
890,428,Yes,2,female,19.000000,0,0,250655,26.0000,S,Miss

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Embarked     889 non-null    object
 10  Status       891 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [11]:
df["Sex"] = df["Sex"].map({"male":1,"female":0})
df.drop("PassengerId",inplace = True,axis = 1)
df["Survived"] = df["Survived"].map({'No':0,"Yes":1})
df.drop("Ticket",inplace = True,axis = 1)

In [12]:
df

     Survived  Pclass  Sex        Age  SibSp  Parch     Fare Embarked Status
0           0       2    1  28.000000      0      0  13.0000        S     Mr
1           0       3    1  25.000000      0      0   7.6500        S     Mr
2           0       3    1  20.000000      0      0   7.8542        S     Mr
3           0       3    0  29.000000      0      4  21.0750        S    Mrs
4           0       1    1  31.000000      1      0  52.0000        S     Mr
..        ...     ...  ...        ...    ...    ...      ...      ...    ...
886         1       2    0  14.000000      1      0  30.0708        C    Mrs
887         0       3    1  22.000000      0      0   7.2292        C     Mr
888         0       3    0  30.000000      0      0   8.6625        S   Miss
889         0       3    1  29.699118      0      0   7.8958        S     Mr
890         1       2    0  19.000000      0      0  26.0000        S   Miss

[891 rows x 9 columns]

In [13]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [14]:
df["Embarked"] = df["Embarked"].map({"S":0,"C":1,"Q":2})

In [15]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()

df['Status'] = lb.fit_transform(df["Status"])

In [16]:
df.dropna(inplace = True)

In [17]:
df

     Survived  Pclass  Sex        Age  SibSp  Parch     Fare  Embarked  Status
0           0       2    1  28.000000      0      0  13.0000       0.0      11
1           0       3    1  25.000000      0      0   7.6500       0.0      11
2           0       3    1  20.000000      0      0   7.8542       0.0      11
3           0       3    0  29.000000      0      4  21.0750       0.0      12
4           0       1    1  31.000000      1      0  52.0000       0.0      11
..        ...     ...  ...        ...    ...    ...      ...       ...     ...
886         1       2    0  14.000000      1      0  30.0708       1.0      12
887         0       3    1  22.000000      0      0   7.2292       1.0      11
888         0       3    0  30.000000      0      0   8.6625       0.0       8
889         0       3    1  29.699118      0      0   7.8958       0.0      11
890         1       2    0  19.000000      0      0  26.0000       0.0       8

[889 rows x 9 columns]

In [18]:
df["Survived"] = df["Survived"].astype(int)
df["Survived"].unique()

array([0, 1])

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn import metrics

x = df[df.columns[1:]].values
y = df["Survived"].values.reshape(-1,1)

xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.25,random_state=0)
x.shape,y.shape

((889, 8), (889, 1))

In [20]:
lg = LogisticRegression()
lg.fit(xtrain,ytrain)
y_pred = lg.predict(xtest)
print(lg.score(xtest,ytest))

0.8295964125560538

/home/no1/.local/lib/python3.10/site-packages/sklearn/utils/validation.py:1141: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/home/no1/.local/lib/python3.10/site-packages/sklearn/linear_model/_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [21]:
from sklearn.metrics import classification_report
print(classification_report(ytest,y_pred))

              precision    recall  f1-score   support

           0       0.83      0.91      0.87       137
           1       0.83      0.70      0.76        86

    accuracy                           0.83       223
   macro avg       0.83      0.81      0.81       223
weighted avg       0.83      0.83      0.83       223

ROC:

In [23]:
from sklearn.metrics import roc_curve

fpr, tpr, thresholds = roc_curve(ytest, y_pred)

print("False Positive Rates:", fpr)
print("True Positive Rates:", tpr)
print("Thresholds:", thresholds)

False Positive Rates: [0.         0.08759124 1.        ]
True Positive Rates: [0.         0.69767442 1.        ]
Thresholds: [2 1 0]

AUC:

In [28]:
from sklearn.metrics import roc_curve, auc

fpr, tpr, thresholds = roc_curve(ytest, y_pred)

# calculate the AUC score
roc_auc = auc(fpr, tpr)
print(roc_auc)

0.8050415888643694